app/models/event.rb

  def self.create_from_collection (events_list)
    events_list.each do |event_hash|
      Event.create(event_hash)
---
INSERT INTO "events" ("title", "url", "date", "address", "venue", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"